modm-io/modm/examples/stm32f4_discovery/open407v-d/touchscreen/lcd.cpp
/*********************************************************************************************************
 *
 * File                : LCD.c
 * Hardware Environment: 
 * Build Environment   : RealView MDK-ARM  Version: 4.20
 * Version             : V1.0
 * By                  : 
 *
 *                                  (c) Copyright 2005-2011, WaveShare
 *                                       http://www.waveshare.net
 *                                          All Rights Reserved
 *
 *********************************************************************************************************/

#include <xpcc/architecture.hpp>

/* Includes ------------------------------------------------------------------*/
#include "lcd.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_fsmc.h"

using namespace xpcc::stm32;

__inline void LCD_WriteIndex(uint16_t index);
__inline void LCD_WriteData(uint16_t data);
__inline uint16_t LCD_ReadData(void);
__inline uint16_t LCD_ReadReg(uint16_t LCD_Reg);
__inline void LCD_WriteReg(uint16_t LCD_Reg, uint16_t LCD_RegValue);
static void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos);
void delay_ms(uint16_t ms);

/* Private define ------------------------------------------------------------*/

#define LCD_REG              (*((volatile unsigned short *) 0x60000000)) /* RS = 0 */
#define LCD_RAM              (*((volatile unsigned short *) 0x60020000)) /* RS = 1 */

/* Private variables ---------------------------------------------------------*/
static uint8_t LCD_Code;

/* Private define ------------------------------------------------------------*/
#define  ILI9320    0  /* 0x9320 */
#define  ILI9325    1  /* 0x9325 */
#define  ILI9328    2  /* 0x9328 */
#define  ILI9331    3  /* 0x9331 */
#define  SSD1298    4  /* 0x8999 */
#define  SSD1289    5  /* 0x8989 */
#define  ST7781     6  /* 0x7783 */
#define  LGDP4531   7  /* 0x4531 */
#define  SPFD5408B  8  /* 0x5408 */
#define  R61505U    9  /* 0x1505 0x0505 */	   
#define  HX8347D    10 /* 0x0047 */
#define  HX8347A    11 /* 0x0047 */	
#define  LGDP4535   12 /* 0x4535 */  
#define  SSD2119    13 /* 3.5 LCD 0x9919 */

/*******************************************************************************
 * Function Name  : delay_ms
 * Description    : Delay Time
 * Input          : - cnt: Delay Time
 * Output         : None
 * Return         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
void delay_ms(uint16_t ms)
{
	uint16_t i, j;
	for (i = 0; i < ms; i++)
	{
		for (j = 0; j < 1141; j++)
			;
	}
}

/*******************************************************************************
 * Function Name  : LCD_Initializtion
 * Description    : SSD1963 Resets
 * Input          : None
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
uint16_t DeviceCode;
uint16_t i;

void LCD_Initializtion(void)
{
	DeviceCode = 0x0123;
	DeviceCode = LCD_ReadReg(0x0000); /* Read LCD ID	*/

	if (DeviceCode == 0x9325 || DeviceCode == 0x9328)
	{
		LCD_Code = ILI9325;
		LCD_WriteReg(0x00e7, 0x0010);
		LCD_WriteReg(0x0000, 0x0001); /* start internal osc */
		LCD_WriteReg(0x0001, 0x0100);
		LCD_WriteReg(0x0002, 0x0700); /* power on sequence */
		LCD_WriteReg(0x0003, (1 << 12) | (1 << 5) | (1 << 4) | (0 << 3)); /* importance */
		LCD_WriteReg(0x0004, 0x0000);
		LCD_WriteReg(0x0008, 0x0207);
		LCD_WriteReg(0x0009, 0x0000);
		LCD_WriteReg(0x000a, 0x0000); /* display setting */
		LCD_WriteReg(0x000c, 0x0001); /* display setting */
		LCD_WriteReg(0x000d, 0x0000);
		LCD_WriteReg(0x000f, 0x0000);
		/* Power On sequence */
		LCD_WriteReg(0x0010, 0x0000);
		LCD_WriteReg(0x0011, 0x0007);
		LCD_WriteReg(0x0012, 0x0000);
		LCD_WriteReg(0x0013, 0x0000);
		delay_ms(50); /* delay 50 ms */
		LCD_WriteReg(0x0010, 0x1590);
		LCD_WriteReg(0x0011, 0x0227);
		delay_ms(50); /* delay 50 ms */
		LCD_WriteReg(0x0012, 0x009c);
		delay_ms(50); /* delay 50 ms */
		LCD_WriteReg(0x0013, 0x1900);
		LCD_WriteReg(0x0029, 0x0023);
		LCD_WriteReg(0x002b, 0x000e);
		delay_ms(50); /* delay 50 ms */
		LCD_WriteReg(0x0020, 0x0000);
		LCD_WriteReg(0x0021, 0x0000);
		delay_ms(50); /* delay 50 ms */
		LCD_WriteReg(0x0030, 0x0007);
		LCD_WriteReg(0x0031, 0x0707);
		LCD_WriteReg(0x0032, 0x0006);
		LCD_WriteReg(0x0035, 0x0704);
		LCD_WriteReg(0x0036, 0x1f04);
		LCD_WriteReg(0x0037, 0x0004);
		LCD_WriteReg(0x0038, 0x0000);
		LCD_WriteReg(0x0039, 0x0706);
		LCD_WriteReg(0x003c, 0x0701);
		LCD_WriteReg(0x003d, 0x000f);
		delay_ms(50); /* delay 50 ms */
		LCD_WriteReg(0x0050, 0x0000);
		LCD_WriteReg(0x0051, 0x00ef);
		LCD_WriteReg(0x0052, 0x0000);
		LCD_WriteReg(0x0053, 0x013f);
		LCD_WriteReg(0x0060, 0xa700);
		LCD_WriteReg(0x0061, 0x0001);
		LCD_WriteReg(0x006a, 0x0000);
		LCD_WriteReg(0x0080, 0x0000);
		LCD_WriteReg(0x0081, 0x0000);
		LCD_WriteReg(0x0082, 0x0000);
		LCD_WriteReg(0x0083, 0x0000);
		LCD_WriteReg(0x0084, 0x0000);
		LCD_WriteReg(0x0085, 0x0000);

		LCD_WriteReg(0x0090, 0x0010);
		LCD_WriteReg(0x0092, 0x0000);
		LCD_WriteReg(0x0093, 0x0003);
		LCD_WriteReg(0x0095, 0x0110);
		LCD_WriteReg(0x0097, 0x0000);
		LCD_WriteReg(0x0098, 0x0000);
		/* display on sequence */
		LCD_WriteReg(0x0007, 0x0133);

		LCD_WriteReg(0x0020, 0x0000);
		LCD_WriteReg(0x0021, 0x0000);
	}
	else if (DeviceCode == 0x9320 || DeviceCode == 0x9300)
	{
		LCD_Code = ILI9320;
		LCD_WriteReg(0x00, 0x0000);
		LCD_WriteReg(0x01, 0x0100); /* Driver Output Contral */
		LCD_WriteReg(0x02, 0x0700); /* LCD Driver Waveform Contral */
		LCD_WriteReg(0x03, 0x1018); /* Entry Mode Set */

		LCD_WriteReg(0x04, 0x0000); /* Scalling Contral */
		LCD_WriteReg(0x08, 0x0202); /* Display Contral */
		LCD_WriteReg(0x09, 0x0000); /* Display Contral 3.(0x0000) */
		LCD_WriteReg(0x0a, 0x0000); /* Frame Cycle Contal.(0x0000) */
		LCD_WriteReg(0x0c, (1 << 0)); /* Extern Display Interface Contral */
		LCD_WriteReg(0x0d, 0x0000); /* Frame Maker Position */
		LCD_WriteReg(0x0f, 0x0000); /* Extern Display Interface Contral 2. */

		delay_ms(100); /* delay 100 ms */
		LCD_WriteReg(0x07, 0x0101); /* Display Contral */
		delay_ms(100); /* delay 100 ms */

		LCD_WriteReg(0x10,
				(1 << 12) | (0 << 8) | (1 << 7) | (1 << 6) | (0 << 4)); /* Power Control 1.(0x16b0)	*/
		LCD_WriteReg(0x11, 0x0007); /* Power Control 2 */
		LCD_WriteReg(0x12, (1 << 8) | (1 << 4) | (0 << 0)); /* Power Control 3.(0x0138)	*/
		LCD_WriteReg(0x13, 0x0b00); /* Power Control 4 */
		LCD_WriteReg(0x29, 0x0000); /* Power Control 7 */

