modm-io/modm/examples/stm32f4_discovery/open407v-d/touchscreen/lcd.cpp
		LCD_WriteReg(0x0011, 0x6068);
	}
	else if (DeviceCode == 0x8999)
	{
		LCD_Code = SSD1298;
		LCD_WriteReg(0x0028, 0x0006);
		LCD_WriteReg(0x0000, 0x0001);
		LCD_WriteReg(0x0003, 0xaea4); /* power control 1---line frequency and VHG,VGL voltage */
		LCD_WriteReg(0x000c, 0x0004); /* power control 2---VCIX2 output voltage */
		LCD_WriteReg(0x000d, 0x000c); /* power control 3---Vlcd63 voltage */
		LCD_WriteReg(0x000e, 0x2800); /* power control 4---VCOMA voltage VCOML=VCOMH*0.9475-VCOMA */
		LCD_WriteReg(0x001e, 0x00b5); /* POWER CONTROL 5---VCOMH voltage */
		LCD_WriteReg(0x0001, 0x3b3f);
		LCD_WriteReg(0x0002, 0x0600);
		LCD_WriteReg(0x0010, 0x0000);
		LCD_WriteReg(0x0011, 0x6830);
		LCD_WriteReg(0x0005, 0x0000);
		LCD_WriteReg(0x0006, 0x0000);
		LCD_WriteReg(0x0016, 0xef1c);
		LCD_WriteReg(0x0007, 0x0033); /* Display control 1 */
		/* when GON=1 and DTE=0,all gate outputs become VGL */
		/* when GON=1 and DTE=0,all gate outputs become VGH */
		/* non-selected gate wires become VGL */
		LCD_WriteReg(0x000b, 0x0000);
		LCD_WriteReg(0x000f, 0x0000);
		LCD_WriteReg(0x0041, 0x0000);
		LCD_WriteReg(0x0042, 0x0000);
		LCD_WriteReg(0x0048, 0x0000);
		LCD_WriteReg(0x0049, 0x013f);
		LCD_WriteReg(0x004a, 0x0000);
		LCD_WriteReg(0x004b, 0x0000);
		LCD_WriteReg(0x0044, 0xef00); /* Horizontal RAM start and end address */
		LCD_WriteReg(0x0045, 0x0000); /* Vretical RAM start address */
		LCD_WriteReg(0x0046, 0x013f); /* Vretical RAM end address */
		LCD_WriteReg(0x004e, 0x0000); /* set GDDRAM x address counter */
		LCD_WriteReg(0x004f, 0x0000); /* set GDDRAM y address counter */
		/* y control */
		LCD_WriteReg(0x0030, 0x0707);
		LCD_WriteReg(0x0031, 0x0202);
		LCD_WriteReg(0x0032, 0x0204);
		LCD_WriteReg(0x0033, 0x0502);
		LCD_WriteReg(0x0034, 0x0507);
		LCD_WriteReg(0x0035, 0x0204);
		LCD_WriteReg(0x0036, 0x0204);
		LCD_WriteReg(0x0037, 0x0502);
		LCD_WriteReg(0x003a, 0x0302);
		LCD_WriteReg(0x003b, 0x0302);
		LCD_WriteReg(0x0023, 0x0000);
		LCD_WriteReg(0x0024, 0x0000);
		LCD_WriteReg(0x0025, 0x8000);
		LCD_WriteReg(0x0026, 0x7000);
		LCD_WriteReg(0x0020, 0xb0eb);
		LCD_WriteReg(0x0027, 0x007c);
	}
	else if (DeviceCode == 0x5408)
	{
		LCD_Code = SPFD5408B;

		LCD_WriteReg(0x0001, 0x0100); /* Driver Output Contral Register */
		LCD_WriteReg(0x0002, 0x0700); /* LCD Driving Waveform Contral */
		LCD_WriteReg(0x0003, 0x1030);

		LCD_WriteReg(0x0004, 0x0000); /* Scalling Control register */
		LCD_WriteReg(0x0008, 0x0207); /* Display Control 2 */
		LCD_WriteReg(0x0009, 0x0000); /* Display Control 3 */
		LCD_WriteReg(0x000A, 0x0000); /* Frame Cycle Control */
		LCD_WriteReg(0x000C, 0x0000); /* External Display Interface Control 1 */
		LCD_WriteReg(0x000D, 0x0000); /* Frame Maker Position */
		LCD_WriteReg(0x000F, 0x0000); /* External Display Interface Control 2 */
		delay_ms(50);
		LCD_WriteReg(0x0007, 0x0101); /* Display Control */
		delay_ms(50);
		LCD_WriteReg(0x0010, 0x16B0); /* Power Control 1 */
		LCD_WriteReg(0x0011, 0x0001); /* Power Control 2 */
		LCD_WriteReg(0x0017, 0x0001); /* Power Control 3 */
		LCD_WriteReg(0x0012, 0x0138); /* Power Control 4 */
		LCD_WriteReg(0x0013, 0x0800); /* Power Control 5 */
		LCD_WriteReg(0x0029, 0x0009); /* NVM read data 2 */
		LCD_WriteReg(0x002a, 0x0009); /* NVM read data 3 */
		LCD_WriteReg(0x00a4, 0x0000);
		LCD_WriteReg(0x0050, 0x0000);
		LCD_WriteReg(0x0051, 0x00EF);
		LCD_WriteReg(0x0052, 0x0000);
		LCD_WriteReg(0x0053, 0x013F);

		LCD_WriteReg(0x0060, 0x2700); /* Driver Output Control */

		LCD_WriteReg(0x0061, 0x0003); /* Driver Output Control */
		LCD_WriteReg(0x006A, 0x0000); /* Vertical Scroll Control */

		LCD_WriteReg(0x0080, 0x0000); /* Display Position �C Partial Display 1 */
		LCD_WriteReg(0x0081, 0x0000); /* RAM Address Start �C Partial Display 1 */
		LCD_WriteReg(0x0082, 0x0000); /* RAM address End - Partial Display 1 */
		LCD_WriteReg(0x0083, 0x0000); /* Display Position �C Partial Display 2 */
		LCD_WriteReg(0x0084, 0x0000); /* RAM Address Start �C Partial Display 2 */
		LCD_WriteReg(0x0085, 0x0000); /* RAM address End �C Partail Display2 */
		LCD_WriteReg(0x0090, 0x0013); /* Frame Cycle Control */
		LCD_WriteReg(0x0092, 0x0000); /* Panel Interface Control 2 */
		LCD_WriteReg(0x0093, 0x0003); /* Panel Interface control 3 */
		LCD_WriteReg(0x0095, 0x0110); /* Frame Cycle Control */
		LCD_WriteReg(0x0007, 0x0173);
	}
	else if (DeviceCode == 0x4531)
	{
		LCD_Code = LGDP4531;
		/* Setup display */
		LCD_WriteReg(0x00, 0x0001);
		LCD_WriteReg(0x10, 0x0628);
		LCD_WriteReg(0x12, 0x0006);
		LCD_WriteReg(0x13, 0x0A32);
		LCD_WriteReg(0x11, 0x0040);
		LCD_WriteReg(0x15, 0x0050);
		LCD_WriteReg(0x12, 0x0016);
		delay_ms(50);
		LCD_WriteReg(0x10, 0x5660);
		delay_ms(50);
		LCD_WriteReg(0x13, 0x2A4E);
		LCD_WriteReg(0x01, 0x0100);
		LCD_WriteReg(0x02, 0x0300);
		LCD_WriteReg(0x03, 0x1030);
		LCD_WriteReg(0x08, 0x0202);
		LCD_WriteReg(0x0A, 0x0000);
		LCD_WriteReg(0x30, 0x0000);
		LCD_WriteReg(0x31, 0x0402);
		LCD_WriteReg(0x32, 0x0106);
		LCD_WriteReg(0x33, 0x0700);
		LCD_WriteReg(0x34, 0x0104);
		LCD_WriteReg(0x35, 0x0301);
		LCD_WriteReg(0x36, 0x0707);
		LCD_WriteReg(0x37, 0x0305);
		LCD_WriteReg(0x38, 0x0208);
		LCD_WriteReg(0x39, 0x0F0B);
		delay_ms(50);
		LCD_WriteReg(0x41, 0x0002);
		LCD_WriteReg(0x60, 0x2700);
		LCD_WriteReg(0x61, 0x0001);
		LCD_WriteReg(0x90, 0x0119);
		LCD_WriteReg(0x92, 0x010A);
		LCD_WriteReg(0x93, 0x0004);
		LCD_WriteReg(0xA0, 0x0100);
		delay_ms(50);
		LCD_WriteReg(0x07, 0x0133);
		delay_ms(50);
		LCD_WriteReg(0xA0, 0x0000);
	}
	else if (DeviceCode == 0x4535)
	{
		LCD_Code = LGDP4535;
		LCD_WriteReg(0x15, 0x0030); /* Set the internal vcore voltage */
		LCD_WriteReg(0x9A, 0x0010); /* Start internal OSC */
		LCD_WriteReg(0x11, 0x0020); /* set SS and SM bit */
		LCD_WriteReg(0x10, 0x3428); /* set 1 line inversion */
		LCD_WriteReg(0x12, 0x0002); /* set GRAM write direction and BGR=1 */
		LCD_WriteReg(0x13, 0x1038); /* Resize register */
		delay_ms(40);
		LCD_WriteReg(0x12, 0x0012); /* set the back porch and front porch */
		delay_ms(40);
		LCD_WriteReg(0x10, 0x3420); /* set non-display area refresh cycle ISC[3:0] */
		LCD_WriteReg(0x13, 0x3045); /* FMARK function */
		delay_ms(70);
		LCD_WriteReg(0x30, 0x0000); /* RGB interface setting */
		LCD_WriteReg(0x31, 0x0402); /* Frame marker Position */
		LCD_WriteReg(0x32, 0x0307); /* RGB interface polarity */
		LCD_WriteReg(0x33, 0x0304); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
		LCD_WriteReg(0x34, 0x0004); /* DC1[2:0], DC0[2:0], VC[2:0] */
		LCD_WriteReg(0x35, 0x0401); /* VREG1OUT voltage */
		LCD_WriteReg(0x36, 0x0707); /* VDV[4:0] for VCOM amplitude */
		LCD_WriteReg(0x37, 0x0305); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
		LCD_WriteReg(0x38, 0x0610); /* DC1[2:0], DC0[2:0], VC[2:0] */
		LCD_WriteReg(0x39, 0x0610); /* VREG1OUT voltage */
		LCD_WriteReg(0x01, 0x0100); /* VDV[4:0] for VCOM amplitude */
		LCD_WriteReg(0x02, 0x0300); /* VCM[4:0] for VCOMH */
		LCD_WriteReg(0x03, 0x1030); /* GRAM horizontal Address */
		LCD_WriteReg(0x08, 0x0808); /* GRAM Vertical Address */
		LCD_WriteReg(0x0A, 0x0008);
		LCD_WriteReg(0x60, 0x2700); /* Gate Scan Line */
		LCD_WriteReg(0x61, 0x0001); /* NDL,VLE, REV */
		LCD_WriteReg(0x90, 0x013E);
		LCD_WriteReg(0x92, 0x0100);
		LCD_WriteReg(0x93, 0x0100);
		LCD_WriteReg(0xA0, 0x3000);
		LCD_WriteReg(0xA3, 0x0010);
		LCD_WriteReg(0x07, 0x0001);
		LCD_WriteReg(0x07, 0x0021);
		LCD_WriteReg(0x07, 0x0023);
		LCD_WriteReg(0x07, 0x0033);
		LCD_WriteReg(0x07, 0x0133);
	}
	else if (DeviceCode == 0x0047)
	{
		LCD_Code = HX8347D;
		/* Start Initial Sequence */
		LCD_WriteReg(0xEA, 0x00);
		LCD_WriteReg(0xEB, 0x20);
		LCD_WriteReg(0xEC, 0x0C);
		LCD_WriteReg(0xED, 0xC4);
		LCD_WriteReg(0xE8, 0x40);
		LCD_WriteReg(0xE9, 0x38);
		LCD_WriteReg(0xF1, 0x01);
		LCD_WriteReg(0xF2, 0x10);
		LCD_WriteReg(0x27, 0xA3);
		/* GAMMA SETTING */
		LCD_WriteReg(0x40, 0x01);
		LCD_WriteReg(0x41, 0x00);
		LCD_WriteReg(0x42, 0x00);
		LCD_WriteReg(0x43, 0x10);
		LCD_WriteReg(0x44, 0x0E);
		LCD_WriteReg(0x45, 0x24);
		LCD_WriteReg(0x46, 0x04);
		LCD_WriteReg(0x47, 0x50);
		LCD_WriteReg(0x48, 0x02);
		LCD_WriteReg(0x49, 0x13);
		LCD_WriteReg(0x4A, 0x19);
		LCD_WriteReg(0x4B, 0x19);
		LCD_WriteReg(0x4C, 0x16);
		LCD_WriteReg(0x50, 0x1B);
		LCD_WriteReg(0x51, 0x31);
		LCD_WriteReg(0x52, 0x2F);
		LCD_WriteReg(0x53, 0x3F);
		LCD_WriteReg(0x54, 0x3F);
		LCD_WriteReg(0x55, 0x3E);
		LCD_WriteReg(0x56, 0x2F);
		LCD_WriteReg(0x57, 0x7B);
		LCD_WriteReg(0x58, 0x09);
		LCD_WriteReg(0x59, 0x06);
		LCD_WriteReg(0x5A, 0x06);
		LCD_WriteReg(0x5B, 0x0C);
		LCD_WriteReg(0x5C, 0x1D);
		LCD_WriteReg(0x5D, 0xCC);
		/* Power Voltage Setting */
		LCD_WriteReg(0x1B, 0x18);
		LCD_WriteReg(0x1A, 0x01);
		LCD_WriteReg(0x24, 0x15);
		LCD_WriteReg(0x25, 0x50);
		LCD_WriteReg(0x23, 0x8B);
		LCD_WriteReg(0x18, 0x36);
		LCD_WriteReg(0x19, 0x01);
		LCD_WriteReg(0x01, 0x00);
		LCD_WriteReg(0x1F, 0x88);
		delay_ms(50);
		LCD_WriteReg(0x1F, 0x80);
		delay_ms(50);
		LCD_WriteReg(0x1F, 0x90);
		delay_ms(50);
		LCD_WriteReg(0x1F, 0xD0);
		delay_ms(50);
		LCD_WriteReg(0x17, 0x05);
		LCD_WriteReg(0x36, 0x00);
		LCD_WriteReg(0x28, 0x38);
		delay_ms(50);
		LCD_WriteReg(0x28, 0x3C);
	}
	else if (DeviceCode == 0x7783)
	{
		LCD_Code = ST7781;
		/* Start Initial Sequence */
		LCD_WriteReg(0x00FF, 0x0001);
		LCD_WriteReg(0x00F3, 0x0008);
		LCD_WriteReg(0x0001, 0x0100);
		LCD_WriteReg(0x0002, 0x0700);
		LCD_WriteReg(0x0003, 0x1030);
		LCD_WriteReg(0x0008, 0x0302);
		LCD_WriteReg(0x0008, 0x0207);
		LCD_WriteReg(0x0009, 0x0000);
		LCD_WriteReg(0x000A, 0x0000);
		LCD_WriteReg(0x0010, 0x0000);
		LCD_WriteReg(0x0011, 0x0005);
		LCD_WriteReg(0x0012, 0x0000);
		LCD_WriteReg(0x0013, 0x0000);
		delay_ms(50);
		LCD_WriteReg(0x0010, 0x12B0);
		delay_ms(50);
		LCD_WriteReg(0x0011, 0x0007);
		delay_ms(50);
		LCD_WriteReg(0x0012, 0x008B);
		delay_ms(50);
		LCD_WriteReg(0x0013, 0x1700);
		delay_ms(50);
		LCD_WriteReg(0x0029, 0x0022);
		LCD_WriteReg(0x0030, 0x0000);
		LCD_WriteReg(0x0031, 0x0707);
		LCD_WriteReg(0x0032, 0x0505);
		LCD_WriteReg(0x0035, 0x0107);
		LCD_WriteReg(0x0036, 0x0008);
		LCD_WriteReg(0x0037, 0x0000);
		LCD_WriteReg(0x0038, 0x0202);
		LCD_WriteReg(0x0039, 0x0106);
		LCD_WriteReg(0x003C, 0x0202);
		LCD_WriteReg(0x003D, 0x0408);
		delay_ms(50);
		LCD_WriteReg(0x0050, 0x0000);
		LCD_WriteReg(0x0051, 0x00EF);
		LCD_WriteReg(0x0052, 0x0000);
		LCD_WriteReg(0x0053, 0x013F);
		LCD_WriteReg(0x0060, 0xA700);
		LCD_WriteReg(0x0061, 0x0001);
		LCD_WriteReg(0x0090, 0x0033);
		LCD_WriteReg(0x002B, 0x000B);
		LCD_WriteReg(0x0007, 0x0133);
	}
	else /* special ID */
	{
		DeviceCode = 0x0123;
		DeviceCode = LCD_ReadReg(0x67);
		if (DeviceCode == 0x0047)
		{
			LCD_Code = HX8347A;
			LCD_WriteReg(0x0042, 0x0008);
			/* Gamma setting */
			LCD_WriteReg(0x0046, 0x00B4);
			LCD_WriteReg(0x0047, 0x0043);
			LCD_WriteReg(0x0048, 0x0013);
			LCD_WriteReg(0x0049, 0x0047);
			LCD_WriteReg(0x004A, 0x0014);
			LCD_WriteReg(0x004B, 0x0036);
			LCD_WriteReg(0x004C, 0x0003);
			LCD_WriteReg(0x004D, 0x0046);
			LCD_WriteReg(0x004E, 0x0005);
			LCD_WriteReg(0x004F, 0x0010);
			LCD_WriteReg(0x0050, 0x0008);
			LCD_WriteReg(0x0051, 0x000a);
			/* Window Setting */
			LCD_WriteReg(0x0002, 0x0000);
			LCD_WriteReg(0x0003, 0x0000);
			LCD_WriteReg(0x0004, 0x0000);
			LCD_WriteReg(0x0005, 0x00EF);
			LCD_WriteReg(0x0006, 0x0000);
			LCD_WriteReg(0x0007, 0x0000);
			LCD_WriteReg(0x0008, 0x0001);
			LCD_WriteReg(0x0009, 0x003F);
			delay_ms(10);
			LCD_WriteReg(0x0001, 0x0006);
			LCD_WriteReg(0x0016, 0x00C8);
			LCD_WriteReg(0x0023, 0x0095);
			LCD_WriteReg(0x0024, 0x0095);
			LCD_WriteReg(0x0025, 0x00FF);
			LCD_WriteReg(0x0027, 0x0002);
			LCD_WriteReg(0x0028, 0x0002);
			LCD_WriteReg(0x0029, 0x0002);
			LCD_WriteReg(0x002A, 0x0002);
			LCD_WriteReg(0x002C, 0x0002);
			LCD_WriteReg(0x002D, 0x0002);
			LCD_WriteReg(0x003A, 0x0001);
			LCD_WriteReg(0x003B, 0x0001);
			LCD_WriteReg(0x003C, 0x00F0);
			LCD_WriteReg(0x003D, 0x0000);
			delay_ms(20);
			LCD_WriteReg(0x0035, 0x0038);
			LCD_WriteReg(0x0036, 0x0078);
			LCD_WriteReg(0x003E, 0x0038);
			LCD_WriteReg(0x0040, 0x000F);
			LCD_WriteReg(0x0041, 0x00F0);
			LCD_WriteReg(0x0038, 0x0000);
			/* Power Setting */
			LCD_WriteReg(0x0019, 0x0049);
			LCD_WriteReg(0x0093, 0x000A);
			delay_ms(10);
			LCD_WriteReg(0x0020, 0x0020);
			LCD_WriteReg(0x001D, 0x0003);
			LCD_WriteReg(0x001E, 0x0000);
			LCD_WriteReg(0x001F, 0x0009);
			LCD_WriteReg(0x0044, 0x0053);
			LCD_WriteReg(0x0045, 0x0010);
			delay_ms(10);
			LCD_WriteReg(0x001C, 0x0004);
			delay_ms(20);
			LCD_WriteReg(0x0043, 0x0080);
			delay_ms(5);
			LCD_WriteReg(0x001B, 0x000a);
			delay_ms(40);
			LCD_WriteReg(0x001B, 0x0012);
			delay_ms(40);
			/* Display On Setting */
			LCD_WriteReg(0x0090, 0x007F);
			LCD_WriteReg(0x0026, 0x0004);
			delay_ms(40);
			LCD_WriteReg(0x0026, 0x0024);
			LCD_WriteReg(0x0026, 0x002C);
			delay_ms(40);
			LCD_WriteReg(0x0070, 0x0008);
			LCD_WriteReg(0x0026, 0x003C);
			LCD_WriteReg(0x0057, 0x0002);
			LCD_WriteReg(0x0055, 0x0000);
			LCD_WriteReg(0x0057, 0x0000);
		}
	}
	delay_ms(50); /* delay 50 ms */
}

