modm-io/modm/examples/stm32f4_discovery/open407v-d/touchscreen/lcd.cpp
/******************************************************************************
 * Function Name  : GUI_Text
 * Description    : 
 * Input          : - Xpos: 
 *                  - Ypos: 
 *				           - str:
 *				           - charColor:
 *				           - bkColor:
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
void GUI_Text(uint16_t Xpos, uint16_t Ypos, const char *str, uint16_t Color,
		uint16_t bkColor)
{
	uint8_t TempChar;
	do
	{
		TempChar = *str++;
		PutChar(Xpos, Ypos, TempChar, Color, bkColor);
		if (Xpos < (MAX_X - 8))
		{
			Xpos += 8;
		}
		else if (Ypos < (MAX_Y - 16))
		{
			Xpos = 0;
			Ypos += 16;
		}
		else
		{
			Xpos = 0;
			Ypos = 0;
		}
	} while (*str != 0);
}

/*******************************************************************************
 * Function Name  : LCD_WriteReg
 * Description    : 
 * Input          : - index:
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
__inline void LCD_WriteIndex(uint16_t index)
{
	//GPIO_ResetBits(GPIOD , GPIO_Pin_7);		 //CS=0;
	LCD_REG = index;
	//GPIO_SetBits(GPIOD , GPIO_Pin_7);		 //CS=1;
}

/*******************************************************************************
 * Function Name  : LCD_WriteReg
 * Description    : 
 * Input          : - index:
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
__inline void LCD_WriteData(uint16_t data)
{
	//GPIO_ResetBits(GPIOD , GPIO_Pin_7);		 //CS=0;
	LCD_RAM = data;
	//GPIO_SetBits(GPIOD , GPIO_Pin_7);		 //CS=1;
}

/*******************************************************************************
 * Function Name  : LCD_ReadData
 * Description    : 
 * Input          : None
 * Output         : None
 * Return         : 
 * Attention		 : None
 *******************************************************************************/
__inline uint16_t LCD_ReadData(void)
{
	//uint32_t tmp;
	//GPIO_ResetBits(GPIOD , GPIO_Pin_7);		 //CS=0;
	//tmp = LCD_RAM;
	//GPIO_SetBits(GPIOD , GPIO_Pin_7);		 //CS=1;
	return LCD_RAM;
}

/*******************************************************************************
 * Function Name  : LCD_WriteReg
 * Description    : Writes to the selected LCD register.
 * Input          : - LCD_Reg: address of the selected register.
 *                  - LCD_RegValue: value to write to the selected register.
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
__inline void LCD_WriteReg(uint16_t LCD_Reg, uint16_t LCD_RegValue)
{
	/* Write 16-bit Index, then Write Reg */
	LCD_WriteIndex(LCD_Reg);
	/* Write 16-bit Reg */
	LCD_WriteData(LCD_RegValue);
}

/*******************************************************************************
 * Function Name  : LCD_WriteReg
 * Description    : Reads the selected LCD Register.
 * Input          : None
 * Output         : None
 * Return         : LCD Register Value.
 * Attention		 : None
 *******************************************************************************/
__inline uint16_t LCD_ReadReg(uint16_t LCD_Reg)
{
	/* Write 16-bit Index (then Read Reg) */
	LCD_WriteIndex(LCD_Reg);

	/* Read 16-bit Reg */
	return LCD_ReadData();
}

/*********************************************************************************************************
 END FILE
 *********************************************************************************************************/
